<a href="https://colab.research.google.com/github/cloud1work1/pandas-tut/blob/main/Pandas1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [4]:
import pandas as pd
import numpy as np

In [ ]:
list = [1,2,4,6,10,7]
series=pd.Series(list)
series

0     1
1     2
2     4
3     6
4    10
5     7
dtype: int64

In [ ]:
dict = {'a':'m', 'b':'i', 'c':'t', 'd':'c', 'e':'h', 'f':'l'}
series2=pd.Series(dict)
series2

a    m
b    i
c    t
d    c
e    h
f    l
dtype: object

In [ ]:
scalarSeries = pd.Series(8, index=[1,2,3,4,5])
scalarSeries

1    8
2    8
3    8
4    8
5    8
dtype: int64

In [ ]:
# All values are NaN
seriesIndex = pd.Series(dict, index=[1,2,3])
seriesIndex

1    NaN
2    NaN
3    NaN
dtype: object

In [ ]:
# Only values matching index
dictN = {1:'a', 2:'j', 3:'i', 4:'n',5:'k',6:'y',7:'a'}
seriesIndex=pd.Series(dictN,index=[1,2,4])
seriesIndex

1    a
2    j
4    n
dtype: object

In [6]:
listData = [{'a':i, 'b':2*i, 'c':3*i} for i in range(5)]
listDF = pd.DataFrame(listData)
listDF

   a  b   c
0  0  0   0
1  1  2   3
2  2  4   6
3  3  6   9
4  4  8  12

In [8]:
seriesData = pd.Series({'Karnataka':'Bengaluru', 'Gujarat':'Ahmedabad', 'Maharashtra':'Mumbai', 'Assam':'Guwahati'})
seriesData2 = pd.Series({'Karnataka':'Kannada', 'Gujarat':'Gujrati', 'Maharashtra':'Marathi', 'Assam':'Assamese'})
seriesDF = pd.DataFrame({'Capital':seriesData, 'Language':seriesData2})
seriesDF

               Capital  Language
Karnataka    Bengaluru   Kannada
Gujarat      Ahmedabad   Gujrati
Maharashtra     Mumbai   Marathi
Assam         Guwahati  Assamese

In [9]:
npDF = pd.DataFrame(np.random.randn(6,3), index=['a','b','c','d','e','f'], columns=['One', 'Two', 'Three'])
npDF

        One       Two     Three
a -0.439029  0.579382 -0.568229
b -0.350949 -0.692328  1.093605
c  1.409070  1.177394  1.474723
d  0.284731 -0.053452 -0.896189
e -0.271910  1.915697 -0.197973
f  1.503670  0.256384 -0.590004

In [10]:
A_Df = pd.DataFrame(np.zeros(5, dtype=[('A','i'), ('B','f')]))
A_Df

   A    B
0  0  0.0
1  0  0.0
2  0  0.0
3  0  0.0
4  0  0.0